In [ ]:
import numpy as np
import pandas as pd

In [ ]:

frame1=pd.DataFrame({'id':['pen','pencil','ball','paper'],
                    'price':[10,20,30,40]})
frame1

       id  price
0     pen     10
1  pencil     20
2    ball     30
3   paper     40

In [ ]:
frame2=pd.DataFrame({'id':['ball','mug','pencil'],
                    'color':['black','red','white']})
frame2

       id  color
0    ball  black
1     mug    red
2  pencil  white

In [ ]:
pd.merge(frame1,frame2)

       id  price  color
0  pencil     20  white
1    ball     30  black

In [ ]:
frame3=pd.DataFrame({'id':['ball','bat','pencil','pen','rubber'],
                     'color':['black','white','red','green','yellow'],
                     'brand':['apple','sumsung','Mi','redmi','oppo']})
frame3

       id   color    brand
0    ball   black    apple
1     bat   white  sumsung
2  pencil     red       Mi
3     pen   green    redmi
4  rubber  yellow     oppo

In [ ]:
frame4=pd.DataFrame({'id':['pencil','pencil','pen'],
                     'brand':['apple','redmi','Mi']})
frame4

       id  brand
0  pencil  apple
1  pencil  redmi
2     pen     Mi

In [ ]:
pd.merge(frame3,frame4)

Empty DataFrame
Columns: [id, color, brand]
Index: []

In [ ]:
pd.merge(frame3,frame4,on='id')

       id  color brand_x brand_y
0  pencil    red      Mi   apple
1  pencil    red      Mi   redmi
2     pen  green   redmi      Mi

In [ ]:
frame4.columns=['id','sid']
pd.merge(frame3,frame4,right_on='sid',left_on='id')

Empty DataFrame
Columns: [id_x, color, brand, id_y, sid]
Index: []

In [ ]:
pd.merge(frame3,frame4,right_index=True,left_index=True)

     id_x  color    brand    id_y    sid
0    ball  black    apple  pencil  apple
1     bat  white  sumsung  pencil  redmi
2  pencil    red       Mi     pen     Mi

In [ ]:
frame3

       id   color    brand
0    ball   black    apple
1     bat   white  sumsung
2  pencil     red       Mi
3     pen   green    redmi
4  rubber  yellow     oppo

In [ ]:
frame4.columns=['id1','sid']
frame3.join(frame4)

       id   color    brand     id1    sid
0    ball   black    apple  pencil  apple
1     bat   white  sumsung  pencil  redmi
2  pencil     red       Mi     pen     Mi
3     pen   green    redmi     NaN    NaN
4  rubber  yellow     oppo     NaN    NaN

In [ ]:
array1=pd.DataFrame(np.arange(6,15).reshape(3,3),index=[3,4,5])
array1

    0   1   2
3   6   7   8
4   9  10  11
5  12  13  14

In [ ]:
array2=pd.DataFrame(np.arange(9).reshape(3,3))+10
array2

    0   1   2
0  10  11  12
1  13  14  15
2  16  17  18

In [ ]:
pd.concat([array1,array2],axis=1)

      0     1     2     0     1     2
0   NaN   NaN   NaN  10.0  11.0  12.0
1   NaN   NaN   NaN  13.0  14.0  15.0
2   NaN   NaN   NaN  16.0  17.0  18.0
3   6.0   7.0   8.0   NaN   NaN   NaN
4   9.0  10.0  11.0   NaN   NaN   NaN
5  12.0  13.0  14.0   NaN   NaN   NaN

In [ ]:
ser=pd.Series(np.random.rand(4),index=[1,2,3,4])
ser1=pd.Series(np.random.rand(4),index=[2,3,4,1])

In [ ]:
ser.combine_first(ser1)

1    0.301546
2    0.850450
3    0.981850
4    0.870096
dtype: float64

In [ ]:
longframe=pd.DataFrame({'color':['black','black','black','red','red','red','white','white','white'],
                        'items':['ball','pencil','pen','ball','pen','pencil','pen','ball','pencil'],
                        'values':np.random.rand(9)})
longframe
wide=longframe.pivot('color','items')
wide

         values
items      ball       pen    pencil
color
black  0.397820  0.482970  0.132008
red    0.851079  0.707749  0.999240
white  0.327390  0.109548  0.377366

In [ ]:
#data transformation
frame11=pd.DataFrame({'color':['red','black','blue','red'],
                      'values':[10,20,13,10]})
frame11

   color  values
0    red      10
1  black      20
2   blue      13
3    red      10

In [ ]:
frame11.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

In [ ]:
frame11.drop_duplicates()

   color  values
0    red      10
1  black      20
2   blue      13

In [ ]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
                      'color':['white','rosso','verde','black','yellow'],
                      'price':[5.56,4.20,1.30,0.56,2.75]})
frame

      item   color  price
0     ball   white   5.56
1      mug   rosso   4.20
2      pen   verde   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [ ]:
newcolor={'rosso':'red','verde':'green','ashtray':'ash'}

In [ ]:
frame.replace(newcolor)

     item   color  price
0    ball   white   5.56
1     mug     red   4.20
2     pen   green   1.30
3  pencil   black   0.56
4     ash  yellow   2.75

In [ ]:
ser=pd.Series([10,20,np.nan,30,np.nan])
ser

0    10.0
1    20.0
2     NaN
3    30.0
4     NaN
dtype: float64

In [ ]:
ser.replace(np.nan,0)

0    10.0
1    20.0
2     0.0
3    30.0
4     0.0
dtype: float64

In [ ]:
frame2

       id  color
0    ball  black
1     mug    red
2  pencil  white

In [ ]:
price={
    'ball':20,
    'mug':30,
    'pencil':44
}

In [ ]:
frame2['price']=frame2['id'].map(price)
frame2

       id  color  price
0    ball  black     20
1     mug    red     30
2  pencil  white     44

In [ ]:
reindex={
    0:1,
    1:2,
    2:3
}

In [ ]:
frame2.rename(reindex)

       id  color  price
1    ball  black     20
2     mug    red     30
3  pencil  white     44

In [ ]:
recolum={
    'id':'name',
}

In [ ]:
frame2.rename(index=reindex,columns=recolum)

     name  color  price
1    ball  black     20
2     mug    red     30
3  pencil  white     44

In [ ]:
result=[10,23,43,12,56,76,78,90,87,67,54,30,44,100]
bin=[0,25,50,75,100]
cat=pd.cut(result,bin)

In [ ]:
cat.categories
cat.codes
cat.value_counts
pd.value_counts(cat)

(75, 100]    5
(50, 75]     3
(25, 50]     3
(0, 25]      3
dtype: int64

In [ ]:
randframe=pd.DataFrame(np.random.randn(1000,3))
randframe.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.018089     0.012673    -0.023993
std       0.973826     0.989562     0.976319
min      -2.978831    -3.069982    -3.471329
25%      -0.665985    -0.662737    -0.695668
50%       0.023137    -0.017335    -0.034566
75%       0.689546     0.707193     0.621760
max       3.366255     3.248835     3.730661

In [ ]:
randframe.std()

0    0.973826
1    0.989562
2    0.976319
dtype: float64

In [ ]:
nframe=pd.DataFrame(np.arange(25).reshape(5,5))
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [ ]:
new_data=np.random.permutation(5)
new_data

array([2, 1, 0, 4, 3])

In [ ]:
nframe.take(new_data)

    0   1   2   3   4
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19

In [ ]:
text = '16 Bolton Avenue , Boston'
text.split(' ')
address,city=[s.strip() for s in text.split(',')]
address
token=[s.strip() for s in text.split(',')]
','.join(token)

'16 Bolton Avenue,Boston'

In [ ]:
frame = pd.DataFrame({ 'color': ['white','red','green','red','green'],
                      'object': ['pen','pencil','pencil','ashtray','pen'],
                      'price1' : [5.56,4.20,1.30,0.56,2.75],
                      'price2' : [4.75,4.12,1.60,0.75,3.15]})
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

In [ ]:
avg=frame['price1'].groupby(frame['color'])
avg

In [ ]:
avg.groups

{'green': Int64Index([2, 4], dtype='int64'),
 'red': Int64Index([1, 3], dtype='int64'),
 'white': Int64Index([0], dtype='int64')}

In [ ]:
avg.mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [ ]:
avg.sum()

color
green    4.05
red      4.76
white    5.56
Name: price1, dtype: float64

In [ ]:
group=frame['price1'].groupby([frame['color'],frame['object']])
group.groups
group.sum()

color  object
green  pen        2.75
       pencil     1.30
red    ashtray    0.56
       pencil     4.20
white  pen        5.56
Name: price1, dtype: float64